Natural_Reef_CFD/highRelief/Scenario_61/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          83;
        startFace       485152;
    }
    outlet
    {
        type            patch;
        nFaces          81;
        startFace       485235;
    }
    atmosphere
    {
        type            patch;
        nFaces          452;
        startFace       485316;
    }
    bathymetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1721;
        startFace       485768;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          485288;
        startFace       487489;
    }
)

// ************************************************************************* //
